<template>
  <div class="content">
    <p class="name">——用户协议</p>
    <div
      class="pritext"
    >—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议—用户协议</div>vue双向绑定：数据劫持+订阅发布者模式
    视图改变更新模型层，模型层改变更新视图层

    <div class="sjx"></div>
  </div>
</template>
<script>
export default {
  name: "yszc",
  data() {
    return {
      text:
        "隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策隐私政策"
    };
  }
};
</script>
<style lang="less" scoped>
.sjx {
  width: 0;
  height: 0;

  border-width: 100px;
  border-style: solid;
  border-color:transparent transparent #0099cc transparent ;
  // transform: rotate(90deg); /*顺时针旋转90°*/
}
.content {
  width: 1200px;
  box-sizing: border-box;
  padding: 25px 40px 90px 40px;
  margin: 30px auto;
}
.pritext {
  white-space: pre-wrap;
  line-height: 30px;
  height: 650px;
  overflow-y: scroll;
}
.title {
  text-align: center;
  color: #2482c8;
  font-size: 50px;
}
.name {
  text-align: left;
  font-size: 30px;
  box-sizing: border-box;
  padding-bottom: 50px;
}
</style>